app/Repositories/SectionsRepository.php

    public function getSectionBySectionId($section_id)
    {
        $result = $this->startConditions()
            ->select(self::COLUMNS)
            ->with([
            'users_section' => function ($query) {
                $query->join('users', 'users.id', '=', 'users_sections_relationships.user_id');
                $query->select(self::COLUMNS_2);
            }
        ])
            ->find($section_id);
---
select `users_sections_relationships`.`id`, `users_sections_relationships`.`user_id`, `users_sections_relationships`.`section_id`, `users`.`name` from `users_sections_relationships` inner join `users` on `users`.`id` = `users_sections_relationships`.`user_id` where `users_sections_relationships`.`section_id` in (11)